Programming/swift/swiftTutorial.org
#+TITLE: Swift Tutorial
#+AUTHOR: Hoyoul Park
#+DESCRIPTION: Org-HTML export made simple.
#+KEYWORDS:  org-mode, export, html, theme, style, css, js, bigblow
#+LANGUAGE:  en
#+OPTIONS:   H:4 toc:t num:2
#+MACRO: color @@html:<font color=""></font>@@
#+PROPERTY:  header-args :padline no
#+SETUPFILE: ~/Mythings/Myprojects/setup/theme-readtheorg.setup
#+HTML_DOCTYPE: html5
- if you want go back?  [[http://www.holytofrege.space/index.html][home]]
*----------
작성자: FregeHoly
작성일: <2018-12-30 Sun>
작성장소: Jeju
날씨: cloudy
-----------*

* comment
  #+begin_note
  주석은 2가지가 있다.
  #+BEGIN_SRC 
  singline: //
  multiline: /* */  
  #+END_SRC
  #+end_note
* print
 #+begin_note
 자주 쓰이는 print 사용법

 print(value), print(name)

  #+begin_quote
  string value는 조금 특이하다.

  print(value \(name))

  ex) print("test\(name)")
  #+end_quote
 #+end_note
 #+BEGIN_SRC swift
 var bint:Int = 3
 print("test \(bint)")
 #+END_SRC

 #+RESULTS:
 : test 3

* Values
#+begin_note
1. string ->predicate logic value
2. true/false -> propositional logic value
3. numbers -> math
이 3개가 기본적인 type이고 value이지만, swift는 엄청나게 많은 type을
만들어버렸다. data structure도 type이고 class도 type이다. 옛날 수학과
논리학만 있었다면, swift에서는 수학 논리학과 같은 type을 수없이 만들 수
있다는 것이다.
#+end_note
#+BEGIN_SRC swift
print("asdfasdf")
#+END_SRC

#+RESULTS:
: asdfasdf

* names
이름은 value를 가리킨다. 이름이 아무것도 가리키지 않는다면 문제가 생긴다.
존재하지 않는것에 이름을 붙일순 없다. 하지만, swift는 약간 유동적이다.
존재하지 않는것을 nil이라는 value라고 하는데, optional로 그 값을 허용할
수도 있다. 이름을 짓는 것은 camelcase로 한다.

또한, value는 종류가 있다. 그것을 type이라고 한다.
종류에 맞게 operator도 정해지기 때문에, 변수나 상수에 type을 명시한다.
swift는 약간 유동적이라서 안해도 된다. 그런데 나는 명시하기로 한다.

** constants
   #+begin_note
   let으로 values를 가르킨다. 이름이다. 변하지 않는다.

   #+BEGIN_SRC swift
   let cons:String = "constants"
   print(cons)
   #+END_SRC

   #+RESULTS:
   : constants

   #+end_note
** variables
   #+begin_note
   var로 value를 가르킨다. 이름이다. 변한다.
   #+BEGIN_SRC swift
   var str:String = "string"
   print(str)
   #+END_SRC

   #+RESULTS:
   : string

   #+end_note
* type conversion
#+begin_note
value가 3개에서 수많은 value가 생긴것은 수많은 type이 만들어졌다는 것을 
의미한다. type간의 변환이 가능한가? type간의 변환이란 말보다 직접적으로
value의 변환이라고 말할 수 있다. 또한 value를 가르키는 이름의 변환이라고도
말할 수 있다.

우선 기본적인 3가지 type에 대한 변환은 가능하다.

int -> string,float,double,bool
float->string,double,int,bool
string->int,float,double,bool =>nil
boole->string
#+BEGIN_SRC swift
var intnum:Int = 3
var floatnum:Float = 3.3
print(String(intnum))
print(Float(intnum))
#+END_SRC

#+RESULTS:
: 3
: 3.0

#+end_note
* 특이한 function(if)
#+begin_note
if는 function이라고 할 수 있다. 
형태는 다음과 같다.
#+BEGIN_SRC 
if condition {
  some code.
} else if condition {
some code.
} else {
some code.
}

#+END_SRC

 좀 특이하다. predicate + form의 형태다. predicate으로 premise를 나타내고
form으로 conclusion으로 conditional expression을 함수를 사용한다는
mccarthy의 생각을 그대로 나타냈다. Mccarthy가 말한 partial function의 개념이
여기에도 들어가 있다. condition이 입력이고, form이 출력이라면, 모든 입력에 
대해 값이 계산되는게 아니라, 일부 값은 undefined될 수 있다. if와 else if에
해당되지 않으면 undefined이기 때문이다. 그래서 else를 추가했다.

#+BEGIN_SRC swift
var bnumber:Int = 8
if bnumber < 10
{
print("number is smaller 10")
}
#+END_SRC

#+RESULTS:
: number is smaller 10

참고할 것중에 하나는, predicate function에 해당하는 조건은 엄청 길어지거나
함수로도 표현 가능하다. a && b && c || d ....이렇게 길어지는 계산을 function
으로 간략하게 표현할 수도 있다.

#+end_note
* 특이한 function - switch function
#+begin_note
Mccarthy가 말한 cond함수와 상당히 유사하다.

형식은 다음과 같다.
#+BEGIN_SRC 
swithc value {
    case value1 : some code

    case value2, value3 : some code
    
    default: some code
}
#+END_SRC

value와 value1 같다면 (true)이면 code를 실행한다. 실행하는게 if처럼 function form형태는
아니다.  :으로 code를 나타낸다. if에선 else로 처리한것을 switch에서 default로
표현한다.

case에서 여러개의 value가 있다면 or연산이 숨어있다. 두번째를 보면 된다.

#+end_note
