Programming/swift/swiftTutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-01-01 Tue 19:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Swift Tutorial</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hoyoul Park">
<meta name="description" content="Org-HTML export made simple."
>
<meta name="keywords" content="org-mode, export, html, theme, style, css, js, bigblow">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Swift Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4d68a7a">1. comment</a></li>
<li><a href="#org5d71c73">2. print</a></li>
<li><a href="#org0d7f746">3. Values</a></li>
<li><a href="#orgae76f2c">4. names</a>
<ul>
<li><a href="#orgad2fb74">4.1. constants</a></li>
<li><a href="#org8f9a69f">4.2. variables</a></li>
</ul>
</li>
<li><a href="#org96a64e0">5. type conversion</a></li>
<li><a href="#org5bda006">6. 특이한 function(if)</a></li>
<li><a href="#org2d7c1e9">7. 특이한 function - switch function</a></li>
<li><a href="#org8d67bbb">8. 특이한 함수 -for in loop</a></li>
<li><a href="#org6afe477">9. 특이한 함수 - while, repeat while</a></li>
<li><a href="#orgef088ba">10. function</a></li>
<li><a href="#org07f6def">11. class</a></li>
<li><a href="#orgeeee3b5">12. classs init function</a></li>
<li><a href="#orge09c0bb">13. class Inheritance</a></li>
<li><a href="#org94816b4">14. optional</a></li>
<li><a href="#orgddd1c51">15. optional binding</a></li>
<li><a href="#orgc237e25">16. optional chaining</a></li>
<li><a href="#org435b561">17. compute Properties</a></li>
<li><a href="#orgad3dfae">18. Array</a></li>
<li><a href="#org0cf53c6">19. dictionary</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>if you want go back?  <a href="http://www.holytofrege.space/index.html">home</a></li>
</ul>
<p>
*-----&#x2013;&#x2014;
작성자: FregeHoly
작성일: <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-30 Sun&gt;</span></span>
작성장소: Jeju
날씨: cloudy
------&#x2013;&#x2014;*
</p>

<div id="outline-container-org4d68a7a" class="outline-2">
<h2 id="org4d68a7a"><span class="section-number-2">1</span> comment</h2>
<div class="outline-text-2" id="text-1">
<div class="note">
<p>
주석은 2가지가 있다.
</p>
<pre class="example">
singline: //
multiline: /* */  
</pre>

</div>
</div>
</div>
<div id="outline-container-org5d71c73" class="outline-2">
<h2 id="org5d71c73"><span class="section-number-2">2</span> print</h2>
<div class="outline-text-2" id="text-2">
<div class="note">
<p>
자주 쓰이는 print 사용법
</p>

<p>
print(value), print(name)
</p>

<blockquote>
<p>
string value는 조금 특이하다.
</p>

<p>
print(value \(name))
</p>

<p>
ex) print("test\(name)")
</p>
</blockquote>

</div>
<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">var</span> bint:<span style="color: #DCDCCC; font-weight: bold;">Int</span> = 3&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"test \(</span>bint<span style="color: #CC9393;">)"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d7f746" class="outline-2">
<h2 id="org0d7f746"><span class="section-number-2">3</span> Values</h2>
<div class="outline-text-2" id="text-3">
<div class="note">
<ol class="org-ol">
<li>string -&gt;predicate logic value</li>
<li>true/false -&gt; propositional logic value</li>
<li>numbers -&gt; math</li>
</ol>
<p>
이 3개가 기본적인 type이고 value이지만, swift는 엄청나게 많은 type을
만들어버렸다. data structure도 type이고 class도 type이다. 옛날 수학과
논리학만 있었다면, swift에서는 수학 논리학과 같은 type을 수없이 만들 수
있다는 것이다.
</p>

</div>
<div class="org-src-container">
<pre class="src src-swift"><span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"asdfasdf"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae76f2c" class="outline-2">
<h2 id="orgae76f2c"><span class="section-number-2">4</span> names</h2>
<div class="outline-text-2" id="text-4">
<p>
이름은 value를 가리킨다. 이름이 아무것도 가리키지 않는다면 문제가 생긴다.
존재하지 않는것에 이름을 붙일순 없다. 하지만, swift는 약간 유동적이다.
존재하지 않는것을 nil이라는 value라고 하는데, optional로 그 값을 허용할
수도 있다. 이름을 짓는 것은 camelcase로 한다.
</p>

<p>
또한, value는 종류가 있다. 그것을 type이라고 한다.
종류에 맞게 operator도 정해지기 때문에, 변수나 상수에 type을 명시한다.
swift는 약간 유동적이라서 안해도 된다. 그런데 나는 명시하기로 한다.
</p>
</div>

<div id="outline-container-orgad2fb74" class="outline-3">
<h3 id="orgad2fb74"><span class="section-number-3">4.1</span> constants</h3>
<div class="outline-text-3" id="text-4-1">
<div class="note">
<p>
let으로 values를 가르킨다. 이름이다. 변하지 않는다.
</p>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">let</span> cons:<span style="color: #DCDCCC; font-weight: bold;">String</span> = <span style="color: #CC9393;">"constants"</span>&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(cons)
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org8f9a69f" class="outline-3">
<h3 id="org8f9a69f"><span class="section-number-3">4.2</span> variables</h3>
<div class="outline-text-3" id="text-4-2">
<div class="note">
<p>
var로 value를 가르킨다. 이름이다. 변한다.
</p>
<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">var</span> str:<span style="color: #DCDCCC; font-weight: bold;">String</span> = <span style="color: #CC9393;">"string"</span>&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(str)
</pre>
</div>

</div>
</div>
</div>
</div>
<div id="outline-container-org96a64e0" class="outline-2">
<h2 id="org96a64e0"><span class="section-number-2">5</span> type conversion</h2>
<div class="outline-text-2" id="text-5">
<div class="note">
<p>
value가 3개에서 수많은 value가 생긴것은 수많은 type이 만들어졌다는 것을 
의미한다. type간의 변환이 가능한가? type간의 변환이란 말보다 직접적으로
value의 변환이라고 말할 수 있다. 또한 value를 가르키는 이름의 변환이라고도
말할 수 있다.
</p>

<p>
우선 기본적인 3가지 type에 대한 변환은 가능하다.
</p>

<p>
int -&gt; string,float,double,bool
float-&gt;string,double,int,bool
string-&gt;int,float,double,bool =&gt;nil
boole-&gt;string
</p>
<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">var</span> intnum:<span style="color: #DCDCCC; font-weight: bold;">Int</span> = 3&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">var</span> floatnum:<span style="color: #DCDCCC; font-weight: bold;">Float</span> = 3.3&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #DCDCCC; font-weight: bold;">String</span>(intnum))&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #DCDCCC; font-weight: bold;">Float</span>(intnum))
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org5bda006" class="outline-2">
<h2 id="org5bda006"><span class="section-number-2">6</span> 특이한 function(if)</h2>
<div class="outline-text-2" id="text-6">
<div class="note">
<p>
if는 function이라고 할 수 있다. 
형태는 다음과 같다.
</p>
<pre class="example">
if condition {
  some code.
} else if condition {
some code.
} else {
some code.
}

</pre>

<p>
 좀 특이하다. predicate + form의 형태다. predicate으로 premise를 나타내고
form으로 conclusion으로 conditional expression을 함수를 사용한다는
mccarthy의 생각을 그대로 나타냈다. Mccarthy가 말한 partial function의 개념이
여기에도 들어가 있다. condition이 입력이고, form이 출력이라면, 모든 입력에 
대해 값이 계산되는게 아니라, 일부 값은 undefined될 수 있다. if와 else if에
해당되지 않으면 undefined이기 때문이다. 그래서 else를 추가했다.
</p>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">var</span> bnumber:<span style="color: #DCDCCC; font-weight: bold;">Int</span> = 8&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">if</span> bnumber &lt; 10&#57344;&#57345;&#57345;
{&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(<span style="color: #CC9393;">"number is smaller 10"</span>)&#57344;&#57345;&#57345;
}
</pre>
</div>

<p>
참고할 것중에 하나는, predicate function에 해당하는 조건은 엄청 길어지거나
함수로도 표현 가능하다. a &amp;&amp; b &amp;&amp; c || d &#x2026;.이렇게 길어지는 계산을 function
으로 간략하게 표현할 수도 있다.
</p>

</div>
</div>
</div>
<div id="outline-container-org2d7c1e9" class="outline-2">
<h2 id="org2d7c1e9"><span class="section-number-2">7</span> 특이한 function - switch function</h2>
<div class="outline-text-2" id="text-7">
<div class="note">
<p>
Mccarthy가 말한 cond함수와 상당히 유사하다.
</p>

<p>
형식은 다음과 같다.
</p>
<pre class="example">
swithc value {
    case value1 : some code

    case value2, value3 : some code

    default: some code
}
</pre>

<p>
value와 value1 같다면 (true)이면 code를 실행한다. 실행하는게 if처럼 function form형태는
아니다.  :으로 code를 나타낸다. if에선 else로 처리한것을 switch에서 default로
표현한다.
</p>

<p>
case에서 여러개의 value가 있다면 or연산이 숨어있다. 두번째를 보면 된다.
</p>

</div>
</div>
</div>
