Programming/swift/swiftTutorial.html
<div id="outline-container-org8d67bbb" class="outline-2">
<h2 id="org8d67bbb"><span class="section-number-2">8</span> 특이한 함수 -for in loop</h2>
<div class="outline-text-2" id="text-8">
<div class="note">
<p>
일반적으로 loop라고 부르는 함수가 있다. for in 형태는 매우 특이하다.
</p>

<p>
형태는 다음과 같다.
</p>
<pre class="example">
for counter(variable name) in lower...upper{
some code
}
</pre>

<p>
매우 특이하다. counter의 이름을 lower나 upper를 가르치게 한다. 그리고 그 변수가
함수의 입력이 되고, 함수의 form은 그대로 사용한다. 각각의 함수에서 인자로 넘어온
counter는 별개의 scope를 갖게 된다. counter가 인자의 역할을 하기 때문에 인자를
주지 않고 lower&#x2026;upper만큼의 수만큼 반복되는 함수를 만들 수 있다. 그렇게 할려면
counter를 _로 표시하면 된다. 또한 counter의 type은 정해져 있다. Int형이다. 왜냐면
주어진 value가 int형 밖에 안된다. lower와 upper를 string으로 하고 counter:String
식으로 하면 에러가 난다. 에러의 이유는 Protocol때문이라는 데 잘 모르겠다.
</p>

<p>
1)for in 전형적인 example1
</p>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">for</span> index <span style="color: #F0DFAF; font-weight: bold;">in</span> 1...3&#57344;&#57345;&#57345;
{&#57344;&#57345;&#57345;
<span style="color: #DCDCCC; font-weight: bold;">print</span>(index)&#57344;&#57345;&#57345;
}
</pre>
</div>

<ol class="org-ol">
<li>for in 각각의 local 인자를 갖는 함수라는 증거 example2</li>
</ol>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">for</span> index <span style="color: #F0DFAF; font-weight: bold;">in</span> 1...5&#57344;&#57345;&#57345;
{&#57344;&#57345;&#57345;
  <span style="color: #F0DFAF; font-weight: bold;">var</span> sum = 0&#57344;&#57345;&#57345;
  sum += index&#57344;&#57345;&#57345;
  <span style="color: #DCDCCC; font-weight: bold;">print</span>(sum)&#57344;&#57345;&#57345;
}
</pre>
</div>
<p>
예상과는 달리 1에서 5까지 합을 출력하지 않는다. loop를 돌때 각각의 함수가
독립적으로 호출 되기 때문이다. 이것을 해결할려면 sum의 scope를 for이전에
기술해야 한다. 이것은 pure function이 아니라는 증거이기도 하다. 이것을
고쳐보자.
</p>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">var</span> sum = 0&#57344;&#57345;&#57345;
<span style="color: #F0DFAF; font-weight: bold;">for</span> index <span style="color: #F0DFAF; font-weight: bold;">in</span> 1...5&#57344;&#57345;&#57345;
{&#57344;&#57345;&#57345;
  sum += index&#57344;&#57345;&#57345;
  <span style="color: #DCDCCC; font-weight: bold;">print</span>(sum)&#57344;&#57345;&#57345;
}
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org6afe477" class="outline-2">
<h2 id="org6afe477"><span class="section-number-2">9</span> 특이한 함수 - while, repeat while</h2>
<div class="outline-text-2" id="text-9">
<div class="note">
<p>
while함수는 우리가 기존에 알고있는 while문과 같다.
</p>
<pre class="example">
while condition {
some code.
}
</pre>

<p>
repeat while의 경우는 condition이 뒤에 있다.
</p>
<pre class="example">
repeat {
some code
} while condition
</pre>

</div>
</div>
</div>
<div id="outline-container-orgef088ba" class="outline-2">
<h2 id="orgef088ba"><span class="section-number-2">10</span> function</h2>
<div class="outline-text-2" id="text-10">
<div class="note">
<p>
형태는 다음과 같다.
</p>

<pre class="example">
func name () {
some code
}
</pre>

<p>
func란 키워드를 사용하고, name과 form으로 구성되어 있다. function name은
camelcase로 작성한다. form안에는 expression이 들어간다. 일반적인 function의
예를 보자.
</p>

<div class="org-src-container">
<pre class="src src-swift"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">addTwoNumbers</span>() {&#57344;&#57345;&#57345;
   <span style="color: #F0DFAF; font-weight: bold;">let</span> a = 1&#57344;&#57345;&#57345;
   <span style="color: #F0DFAF; font-weight: bold;">let</span> b = 2&#57344;&#57345;&#57345;
   <span style="color: #F0DFAF; font-weight: bold;">let</span> c = a + b&#57344;&#57345;&#57345;
   <span style="color: #DCDCCC; font-weight: bold;">print</span>(c)&#57344;&#57345;&#57345;
}
</pre>
</div>

<p>
위에서 보듯이 c = a+b라는 expression을 나타내기 위해서 name과 operator를 
사용했다. 솔직히 간단한 expression인데도 programming language에선 좀 
복잡하다. function을 지우고, 그냥 let부터 print까지 써도 실행하는데 문제가 
없다. expression만 죽 나열해도 되는데 이렇게 쓰는 이유는 한번 정의하면 재사용이
가능하기 때문이다.
</p>

<p>
또다른 예를 보자. 
</p>

<p>
return값이 있는 function
</p>

<pre class="example">
func addTwoNumber() -&gt; Int {
   let a = 1
   let b = 1
   let c = a + b
   return c
}
let sum = addTwoNumbers()
</pre>

<p>
return값이 있는 함수는 expression만 표현한것과는 다르다. function이 재사용으로만
사용하는게 아니라, 특정 값을 표현하는 것처럼 보인다. value처럼 sum이 function을
가르킨다. return값이 있는 function은 value라고 보여진다. 형식적으로는 return값의
type을 function에 기술하는데, 이 부분도 function이 값으로 취급됨을 보여준다.
</p>

<p>
이제 인자가 있는 경우를 보자.
</p>

<pre class="example">
func addTwoNumbers(arg para:Int) -&gt; Int {
   let a = para
   let b = 1

   return a+b
}
let sum = addTwoNumbers(arg: 2)

</pre>

<p>
argument가 있는 function은 좀 다르다. 우선 argument label이란게 있다. 이것은
lambda 함수의 영향을 받았다. lambda (x y) (y<sup>2</sup> + x)에서 앞에 (x y)는 form에서의
bound variable 적용 순서를 가르킨다. 그래서 함수가 적용될때 (3 4)라는 인자에 
대해서 13이란 값, 19라는 값이 결정되기 모호한것을 해결하기 위해 lambda calculus에선
x가 3이고 y가 4라는 것을 가리킨다는 것을 명시적으로 보여주기 위해서 (x y)가 추가되었다고
Mccarthy논문에서 밝히고 있다. 따라서 지금 swift에서 argument label은 람다형식을
따르고 있다. 즉 argument label을 사용해서 호출할 때, 이 값은 어떤 변수와 binding
될것임을 명확히 해준다. 이건 기존의 프로그램에는 없는 방식이다. 그래서 swift에서는
기존과 같이 쓸수 있게 argument label을 _로 설정하면 기존 프로그래밍처럼 
addTwoNumbers(2)라고 쓸수 있게 된다.
</p>


<p>
그리고 함수에 사용되는 내부 인자들은 name이다. name은 무언가를 가리켜야 한다.
아무것도 없는데 가리키면 안된다. 이런 일이 함수를 정의하는데 있어선 자주 일어난다.
함수에선 인자를 그냥 쓰는 경우가 많다. swift에선 그런경우를 위해서 optional이란것도
준비해두었다. 
</p>

</div>
</div>
</div>
