Programming/swift/swiftTutorial.org
* class 
#+begin_note
현대 언어는 상당히 복잡하다. 옛날 언어는 value와 value를 모은 structure, structure
가 있어서 생기는 operator만 가지고 프로그래밍을 했다. 거기서 value의 종류가 달라도 
각각의  value와 관련된 연산이 적용되었거 그 연산과 value로 computation을 했다. value를
한데 모아서 data structure란 것도 만들고, structure가 만들어지면서 자연스럽게
operator도 생겼다. 이것은 기존의 학문 predicate logic, propositional logic, math에
있던것이다. 그런것들이 mathlogic과 programming language의 과정을 거치면서 변하게
된다. mathlogic과 programming language에선 3개의 서로다른 value들을 조합해서 사용해야하고
3개의 서로 다른 type에 적절한 structure, operator도 합쳐써야 했다. 그런것을 하기 
위해서 함수라는 math방법론이 사용되게 된다. function은 type에 구분하지 않고 쓴다. 
type에 독립적이다.따라서 type을 명시를 해주어야 한다. 어떤 type을 써써 어떻게 할것인가?
그것을 function definition이라고 한다. 수많은 function을 사용해서 우리는 3개의 type을 넘나드는
cross over한 연산이 가능해 졌다. 즉 function은 return값이 있는경우, 뭉뜬거려서 
하나의 값으로 볼 수 있는데, 어차피 수행결과가 값이기 때문이다. name이 특정 value를
가리키고 있고, 해석을 통하면 하나의 value로 되는 것과 마찬가지다. 그런데 operator의 경우
bool값을 가지고 조합해서 bool을 리턴한다. bool operator는 bool value로 볼 수 있다.
function은 cross over라고 말했듯이, int, float, double, bool, string 여러 값을
표현한다. 정의를 어떻게 하느냐의 따른다. 

그런데 여기서 class란게 나온다. class란것은
하나의 type을 만들겠다는 것이다. 기존의 type은 자신만의 value가 있었고, 그것에 따른
structure와 operator가 있었다. 새로운 type을 만들려면 그래야 한다. 그런데, class는
좀 다르다. 마치 data structure처럼 비슷한 형태지만, function처럼 type에 독립적이다.
우리가 array란 자료구조를 보면 int array처럼 type에 종속적이다. 또한 structure는
value를 모은거라서, constant의 집합으로 보면 된다. 요즘은 type에 종속적이지 않은 
structure를 만들어서 많이 사용한다. 반면 class는 data
structure와 비슷하지만, constant만 사용하는 게 아니라 variable도 사용한다. 그리고  type에 종속적이지 않다. 
여러종류의 data를 모아서 사용한다. 아까 말했듯이  요즘 언어의 structure는 여러종류의 
value로 모아져 있을 수 있다. 다만 constants로 구성된건 변함이 없는거 같다.
그래서 function과 상당히 비슷하다. function처럼 type에 의존적이지 않기 때문에
function처럼 어떤 type을 사용해서 무엇을 할것인지 명시해줘야 한다. class도 definition
이 필요한 것이다. function이 return값을 사용하면서 value의 역할도 하듯이 class도
instance화 되면서 value의 역할을 하게 된다. 그런데 이 value는 좀 다르다. function도
value를 return하면서 마치 function이 value처럼 보이기도 하지만, 어디까지나 기존의
value형태로 도출되었지 새로운 value를 만든건 아니였다. 그런데 class는 기존의 type
에서 사용된 value를 사용해서 해서 하나의 구조체(data structure)를 만들었지만, type이
없기 때문에 새로운 type을 만들고 새로운 value를 만들어버린다. 새로운 value를
만든다는 것은 대단하다. 새로운 value에 대한 operator는 무엇인가? function이 그 
역할을 하게 된다. function은 원래가 이종적인 data type을 처리하고 type에 맞는 
value를 return한다. 그런데 class란 놈이 새로운 value를 만들어 냈는데, 이 value를
처리하는 operator는 새롭게 만드는 것이 아닌, function을 이용하는 것이다. function이란게
원래 잡놈이기 때문에 이를 충실히 수행한다. 

class는 또 한편으로는 data structure와 비슷하기도 하다. data structure는 
type종속적이여서, 그 structure를 사용하는 operator 또한 type 종속적이다. 반면
class는 data structure와 마찬가지로 여러 value를 가지고 있다. 이 value는 data
structure처럼 한가지 값만으로 이루어지지 않았다. 그래서 그것을 처리하는 operator도
function을 쓴다고 한다. class는 그 자체가 하나의 value로 사용되기도 하지만,
여러개의 data가 내부적으로 저장되어 있고, function을 통해서 그 값을 가져올수도
변경할 수도 있다. 그 자체가 value인 동시에 내부적으로도 value를 가지고 있는
특이한 형태다. 예를 들어보자.
#+BEGIN_SRC 
class person {
   var name = "holy"
   var age = 0

   func test() ->Int
   {
      return age + 10
   }
}

var a = person()
a. name
#+END_SRC
위에서 보면 Person()로 value를 만든다. 그리고 a라는 이름을 붙인다. value에
이름을 붙이는 것은 너무나 당연하기 때문이다. class는 value라는 것을 보여준다.

그런데 그 value내부의 또다른 value를 a.name이란 식으로 조작할 수 있다. class는
atom value는 아니다. function은 하나의 value만 표시하지만, class에는 여러 
종류의 value가 있다. a.name, a.age 등 여러가지가 있다.

그리고 상수라고 부르는 이름은 변경하지 못했다. 변수로 value를 가리킬때
우리는 value를 변경할 수 있었다. 마찬가지로 function이나, class에서의
value들은 변수를 가지고 있다. argument라고 한다. 그것을 변경 시키면서
value를 변경하는 것이다.

class의 탄생으로 우리는 엄청나게 많은 type과 그 type에 맞는 value를 갖게 되었다. 현대 언어는 매우 복잡하게 되었다.

class definition은 다음과 같다. 

#+BEGIN_SRC 
class cname {
  var a = 3
  var b = 2
  
  func f ->Int {
  return a+b
  }
}

cname() -->value를 만든다.
var classname = cname() -->value이기 때문에 이름도 있을 수 있다.
#+END_SRC

class는 여러 type의 기능을 조합적으로 사용해서 만들기 때문에 definition이
필요하다고 했다. 어떤 type을 사용해서 만드는지 알아야 할 것 아닌가? 이렇게
만드는게 class definiton이다. class를 만들고 class name()하면 value가 
만들어진다. value가 만들어지면 name도 붙일 수 있다.

#+end_note
* classs init function
#+begin_note
class의 생성자라고 볼 수 있다. return값은 없는 그냥 함수다.

사용법은 다음과 같다.

#+BEGIN_SRC 
class Car 
{
   var speed:Int = 10
   init(paraLabel number:Int = 10)
   {
   self.speed = number
   }
}
#+END_SRC
내부 변수를 사용하기 위해서 self를 사용할 수도 있고 그냥 speed라고 써도 된다.
그런데 self를 안쓰면 name confliction이 발생할 수 있으니까, self를 쓰자.

class의 내부 변수를 property는 그냥 name이라고 볼 수 있지만, 약간 다르다.
class에서 
#+BEGIN_SRC 
class Car
{
   var speed:Int
}
#+END_SRC
위와 같이 사용할 수는 없다. var speed:Int를 선언하는건 일반적으로 문제가 없었는데
property에서는 불가능 하다. 그래서 초기화를 class에선 반드시 해줘야 한다.
초기화 해주는 함수를 init이라고 부르는데, designated init으로 부르기도 한다.
초기화 함수의 역할에 맞게 모든 property를 초기화 해야 한다. 반면에 필요한것만
초기화 할수 있는데, 그것을 convenience init함수라고 한다.
사용법은 아래와 같다.
#+BEGIN_SRC 
class Car
{
   var speed:Int
   var name:String
   init()
   { 
     self.speed = 5
     self.name = "mycar"
    }
   convenience int()
   {
     self.init()
     self.name = "yourcar"
   }
#+END_SRC

#+end_note
* class Inheritance
#+begin_note
class는 수만개의 type과 value를 만들 수 있게 되었다. class는 type을 만드는데
새롭게 만든다. 상속이란 방법을 통해서 기존의 type을 재사용하는 것이다. 재사용의
의미도 있지만, 우리가 operator라는 아주작은 function으로 부터 복잡한 function을
만들어서 쉽게 사용했던 거와 비슷하게 사용할 목적으로 inheritance라는 개념을 사용
한것이다. 

사용법
#+BEGIN_SRC 
class MyCar : Car
{
}
#+END_SRC

이렇게 쉽게 상속한다. 이렇게 되면 Car라는 superclass에서 사용하는 함수와 value를
사용할 수 있게 된다. 그리고 function도 재정의가 가능하다.

override function의 예를 보자.
#+BEGIN_SRC 
class Car {
   var speed = 200

   func drive {
       print("Driving at \(speed)")
       }
  }

class myCar : Car {
   override func drive() {
       super.drive()
       print("mycar print")
       }
       func fly(){
       print("flying")
       }
}
#+END_SRC
여기서 보면 car를 상속받고 function을 재정의 할 수 있다. function을 재정의
한다는 의미는 아예 새롭게 쓰겠다는 말이다. 그런데 superclass에서 사용된 내용도
지우지말고 수행하려면 super().drvie()를 사용한다.
#+end_note
