Programming/swift/swiftTutorial.org
* optional
#+begin_note
swift에선 optional이란게 있다. 모든 variable, constant는 name이기 때문에
value를 가리켜야 한다. 만일 가르키지 않는다면, 존재하지 않는데, 이름이 있는경우가
된다. 이것은 나중에 문제가 될 수 있다. 우리가 존재하지 않는데 이름만 가지고 
무엇을 변경한다거나, operator를 가한다면 error가 날 수 있다. 이름만 선언하는건
문제가 없는데, 즉,evaluation할때 문제가 된다. 그래서 optional로 선언하면 nil이라는
값을 갖게 된다. 이것을 wrapping이라고 한다. wrapping을 하면 무조건 nil이란 보호막으로
둘러싸진다. 이게 좀 특이하다.

#+BEGIN_SRC 
var name:String? = "holy"
print(name)
#+END_SRC
이것은 에러가 난다. 왜냐면 nil이란 wrap으로 둘러 싸여져 있고 내부에 holy라는 value를
가지고 있다. print는 string operator이기 때문에 string만을 입력으로 받고 value가
아니면 evaluate해서  nil이 deduce되면 에러를 난다. 에러를 없애기 위해서는 wrap을 풀어야 한다. 
그것은 !을 사용한다.하지만, 이방식은 추천하지 않는다. 강제적이기 때문에 비추한다.  강제적이지 않고 if else로
풀어야 한다고 apple은 말한다. 즉 !는 2번 evaluate하는 것이다.

모든 value를 가리키는 name에게서만 optional처리를 한다. 왜냐 이름이 가리키는
value가 아예 없을수 있기때문이다. 그러면 value는 어떤게 있는가? 
primitive한 value,  class도 value, function도 value라고 할 수 있다. primitive한
value도 name으로 가리키고, class를 가리키는 name도, function을 가리키는 name도
optional이 될 수 있다는 것이다. 

여기서 optional은 evaluate하면  nil이라는 값을 갖게 된다는 것이 많은 변화를 일으킨다. 
optional로 하게 되면, bool값으로도 활용될 수 있다는 것이다. 예를 들어보자.

#+BEGIN_SRC 
var strname:String?

if let a = strname {
   print(a + "test")
}
#+END_SRC
좀 이상한 구조긴 한데, 이게 수행 될까? 수행된다. 왜냐면, let은 symbol이 value를
가리키는 name이다. let 심볼 = 심볼에선 오른쪽 symbol에서 evaluation이 일어난다. 
value가 아니기때문이다. 그래서 strname을 evaluate하면 nil이 나온다. 그리고 a는
constant이기 때문에,  if nil {} 과 같은 형식을 같는다고 보면 된다. 그래서 
print문을 출력하지 않는다.

#+BEGIN_SRC 
var strname:String? = "string name"

if let a = strname {
   print(a + "test")
}
#+END_SRC
이것은 어떻게 수행 될까? 이것은 if "string name" { }이라고 보면 된다. 
if value 형태라서 수행이된다. 

다시 한번 복습해보자.
#+BEGIN_SRC 
var myname:String?

print(!myname + "really?")
#+END_SRC
여기서 보면, myname은 value가 nil이다. 그런데 string연산을 한다. nil은
bool type인데 string operator인 +를 사용한다는 것은 에러가 나야 한다. 그렇다.
에러가 난다.

 이것을 없애기 위해서 myname!을 통해서 원래의 type으로 강제 적용한다.
이것을 unwrapping이라고 하는데, unwrapping해도 에러는 난다. 왜냐면 value를
가리키지 않는 name이라서 그렇다.

optional은 재밌는 개념이다. 이것을 통해서 여러가지 value를 가리키는 name들이
일시적으로 nil값을 가리키게 된다.

#+end_note
* optional binding
#+begin_note
optional은 모든 name이 nil을 가리킬수 있다는 것이다. 주어진 type의 value와
nil을 가리킨다. 이럴경우 optional을 명확하게 하나의 value를 가리키도록 정해줄
필요가 있다. 이것을 optional binding이라고 한다. 즉 name을 사용하고자 할때,
우리는 optional의 형태를 갖는 name이라면 명확히 binding해주고 사용해야 한다.
binding하는 방식은 또다른 constant를 사용한다. 
#+BEGIN_SRC 
var test:String = "teststring"

if let newtest = test {
    print("this is new test"+newtest)
}
else {
}
#+END_SRC
이렇게 let으로 또다른 상수를 만들어서 그 상수를 처리한다. 어..그럼 좀 이상하지
않나? 위에서 test는 변수인데, 아래에서 let으로 상수로 바꿔서 처리한다? 난 변수로
쓰고 싶은데...이건 어쩔수 없다. if condition에서 variable이 사용된다면 runtime
실행 때 safe 하지 않기 때문에 이렇게 binding하는 작업에선 let으로 처리한다. 즉
변수로 되어 있는 이름이라도, runtime시에는 그 실행하는 순간의 값으로 binding해야
하기 때문에 let을 쓴다는 것이다.

#+end_note
* optional chaining
#+begin_note
name을 사용하는 경우는 class에서도 많이 사용된다. class내부에서 name(변수,상수)가
사용되는데, class자체도 value라서 class를 사용하는 경우, 대부분 name을 사용한다.
그래서 class자체가 optional로 선언될 수도, class내부의 변수가 optional로 선택
될 수도 있다. 이럴때 사용하는게 optional chaning이다. optional이 사용된 name에서 
또다른 name을 사용할때 chaining(묶어서)사용하겠다는 뜻이다.
예를 들어보자.
#+BEGIN_SRC 
class Person {
 var residence: Residence?
}
class Residence {
 var numberOfRooms = 1
}
let john = Person()
#+END_SRC
여기서 보면, John은 name이고, Person()은 value다. 이 value내부에는 또다른
name이 있다. residence라는 이름은 value를 가르키지 않는 name이다. 그래서 
optional로 되어 있다. 이것을 binding해서 사용해보자.

#+BEGIN_SRC 
let john = Person()
if let count = john.residence?.numberOfRooms {
}
else {
}
#+END_SRC

즉 우리가 optional로 선택한게 Residence라는 class의 value다. 그 value내부의
value를 접근하려고 한다면, Residence의 value를 ?로 명확히 optional value임을
표시해준다. 이것을 optional chaining이라고 한다. binding하는 것은 primitive
value를 처리하는 것과 별다를 바 없다.
#+end_note
* compute Properties
#+begin_note
property라는 건 그냥 class의 내부 name을 가리킨다고 보면 된다. 기존의 oop개념과
다를게 없다. 그런데 compute property라는 새로운게 있다. 이것은 약간 function과
form의 개념을 알아야 하는데, 솔직히 꼭 property에만 해당되는게 아니라, 모든 name에
사용될 수 있는 것이다.

function에 대한 개념은 예전부터 많았다. 그러나 표기하는 방법은 여러가지가 있었다고
한다. 가장 유명한게 labmda방식도 있고, programming language의 function도
있다. lambda에선 function의 이름과 form을 분리한다. form은 순수 계산과정이다.
계산과정의 결과는 value다. function은 이름과 argument 그리고 value를 가지고있다고
생각하면 된다. 이 개념을 응용한다면, compute properties라는 개념도 잡을 수 
있을 듯 하다.
#+BEGIN_SRC 
var tempstr:String {
   var tempbool:Bool = true
   if tempbool {
      return "you're ok"
      }
      else {
      return "you're good!"
      }
#+END_SRC
위와 같은 개념이 가능하다. 어차피 function에서 form은 value다. 그렇기 때문에,
그 값을 name으로 가리키는건 무리한 생각이 아니다. property에 있는 name에만
적용하는게 아니라 그래서 일반적인 name에도 적용 가능하다.

#+end_note
* Array
#+begin_note
Array는 structure다. structure는 원래 value를 모아놓은 것이다. 특정 구조에
맞추어서, 예를 들면, Maccarthy논문 분석글에도 썼듯이, 선반을 갖다놓으면 음식을
선반위에 놓을 수 있듯이, value를 구조에 맞게 조작하는 operator가 반드시 있기
마련이다. 

그리고 원래 structure라는 건 type에 영향을 받는다. 그래서 true/false를 담는
structure도 있고, int를 담는 structure도 있고, string을 담는 structure가
있는 것이다. 각기 type에 맞는 structure를 가지고 있다. 다만, structure의 value
가 type에 의존적이란 말이지, bool type에는 array를 사용할수 없고, int type에만
array가 있는 것은 아니다.

여튼 array를 보자.
#+BEGIN_SRC 
var temparray = [String]()
var myarray = [ "adsf", "dsaf","dsafasdfsa"]
#+END_SRC
이렇게 사용한다. string array가 되겠다. 첫번째는 빈 array를 만든건데, 
조금 특이하다. type을 명시하고 함수 호출하듯이 했다. 두 번째는 익숙하다.

structure에는 operator가 있다고 했다. 왜냐면 structure에서 값을 넣고 꺼내야
하기 때문에 당연히 operaotr가 있다. insert(),remove()...등등 여러가지 operator
가 존재한다.

우선 여기서는 모든 structure는 function으로 표현될 수 있기 때문에, 내부적으로도
structure는 function으로 되어 있기때문에 function같이 처리가 가능 하다.

예를 들어보자.

#+BEGIN_SRC 
var mycar = ["benz", "pony", "sonata"]
print(mycar[0])
#+END_SRC
위에서 보듯이 mycar[0], mycar[1]...이런식으로 값을 표현할 수 있다. 
domain은 자연수가 되고, range가 값이 되기 때문이다. 그냥 함수이기 때문에
이렇게 표현이 가능하다. 

 {{{color(red,[array의 사용])}}}
array는 for loop와 같이 사용되곤 한다.
#+BEGIN_SRC 
var d = ["dog","cat"]

for counter in 0...2 {
    print("my" + d[counter]
}

for item in d {
  print ("my " + item)
}
#+END_SRC     

{{{color(red,[array의 operator들])}}}

1) append operator

두개의 array를 합치는 것이다.

간단하게 +를 사용할 수 있다.

#+BEGIN_SRC 
var d = ["dog","cat"]
d += ["mouse"]

print(d)
#+END_SRC
     
1) length

#+BEGIN_SRC 
var d =["dog","cat"]
d.count
#+END_SRC
array의 길이를 알 수 있다. 더 많은 array operator가 있지만, doc을 
참고해야 한다.

#+end_note
