Programming/swift/swiftTutorial.org
* dictionary
#+begin_note
array가 domain을 자연수로 갖는 함수로 본다면, dictionary는 domain을 이루는
원소가 string이다. 관계는 key와 value관계다. 함수의 domain은 set이기 때문에
unique하다. 즉 key가 동일한 것은 없다. array는 domain이 자연수였기 때문에 
range의 type을 기술하는 식으로 새로운 array를 만들었다. 반면에 dictionary는
두개의 type을 모두 기술해야 한다. 한번보자. 두개의 type을 기술해서 empty
dictionary를 만든다.

#+BEGIN_SRC 
 var d = [String]()
 var e = [String:String]()
#+END_SRC

dictionary와 array가 가장 큰 차이가 있는데, array의 domain은 자연수로
자동 매치되기 때문에 undefined value가 있을 수 있다.
#+BEGIN_SRC 
var array1 = ["one","two"]
print(array1[3])
#+END_SRC

이렇게 되면 3에 해당하는 value가 없다. undefined되었기 때문에 error가 난다.

이제 dictionary를 보자.
#+BEGIN_SRC 
var dict["one"] = "1"
print(dict["two"])
#+END_SRC

이것은 에러가 날까? nil이 출력이 된다. 분명히 two라는 key에 value가 없음에도
불구 하고 dictionary는 에러가 나지 않는다. 그렇다고 해서 string value를 출력하지
않고 nil을 출력한다. 이것은 무슨의미일까? 그렇다. dictionary는 optional로 
선언된다는 것이다.

{{{color(red,[dictionary의 operators])}}}

1) remove

가장 간단한 operation은 [key,value]를 삭제하는 것이다.
#+BEGIN_SRC 
var dic["one"] ="1"
dic["two"] = "2"

dic["one"] = nil
#+END_SRC
여기서, nil로 값을 갖게 되면 자연스럽게 지워진다.

2) for in과 사용
#+BEGIN_SRC 
var dic["one"] ="1"
dic["two"] = "2"

for (letter, num) in dic
{
   print(num)
}
#+END_SRC
이렇게 하면 for loop에서 사용할 수 있다. (key,value)의 형태를 잊지말자.
#+end_note
