Programming/swift/swiftTutorial.html
<div id="outline-container-org0cf53c6" class="outline-2">
<h2 id="org0cf53c6"><span class="section-number-2">19</span> dictionary</h2>
<div class="outline-text-2" id="text-19">
<div class="note">
<p>
array가 domain을 자연수로 갖는 함수로 본다면, dictionary는 domain을 이루는
원소가 string이다. 관계는 key와 value관계다. 함수의 domain은 set이기 때문에
unique하다. 즉 key가 동일한 것은 없다. array는 domain이 자연수였기 때문에 
range의 type을 기술하는 식으로 새로운 array를 만들었다. 반면에 dictionary는
두개의 type을 모두 기술해야 한다. 한번보자. 두개의 type을 기술해서 empty
dictionary를 만든다.
</p>

<pre class="example">
var d = [String]()
var e = [String:String]()
</pre>

<p>
dictionary와 array가 가장 큰 차이가 있는데, array의 domain은 자연수로
자동 매치되기 때문에 undefined value가 있을 수 있다.
</p>
<pre class="example">
var array1 = ["one","two"]
print(array1[3])
</pre>

<p>
이렇게 되면 3에 해당하는 value가 없다. undefined되었기 때문에 error가 난다.
</p>

<p>
이제 dictionary를 보자.
</p>
<pre class="example">
var dict["one"] = "1"
print(dict["two"])
</pre>

<p>
이것은 에러가 날까? nil이 출력이 된다. 분명히 two라는 key에 value가 없음에도
불구 하고 dictionary는 에러가 나지 않는다. 그렇다고 해서 string value를 출력하지
않고 nil을 출력한다. 이것은 무슨의미일까? 그렇다. dictionary는 optional로 
선언된다는 것이다.
</p>

<p>
<font color=""></font>
</p>

<ol class="org-ol">
<li>remove</li>
</ol>

<p>
가장 간단한 operation은 [key,value]를 삭제하는 것이다.
</p>
<pre class="example">
var dic["one"] ="1"
dic["two"] = "2"

dic["one"] = nil
</pre>
<p>
여기서, nil로 값을 갖게 되면 자연스럽게 지워진다.
</p>

<ol class="org-ol">
<li>for in과 사용</li>
</ol>
<pre class="example">
var dic["one"] ="1"
dic["two"] = "2"

for (letter, num) in dic
{
   print(num)
}
</pre>
<p>
이렇게 하면 for loop에서 사용할 수 있다. (key,value)의 형태를 잊지말자.
</p>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hoyoul Park</p>
<p class="date">Created: 2019-01-01 Tue 19:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
